FI/Esitiedot/Integraatiopalvelu_Esitiedot_Esimerkkisanoma_queryEsitieto_Request_1.3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Tieto.HCW.EIS.Esitiedot.Contracts" xmlns:tem="http://tempuri.org/" xmlns:tiet="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:tiet1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Esitiedot.Contracts">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:Esitiedot_Kysely_Request>
         <!--Optional:-->
         <tem:MessageHeader>
            <!--Optional:-->
            <!--type: string-->
            <tiet:MessageID>gero et</tiet:MessageID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:TransactionID>sonoras imperio</tiet:TransactionID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderID>quae divum incedo</tiet:SenderID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderApplication>verrantque per auras</tiet:SenderApplication>
            <!--type: string-->
            <tiet:ReceiverID>per auras</tiet:ReceiverID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ReceiverApplication>circum claustra</tiet:ReceiverApplication>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CharacterSet>nimborum in</tiet:CharacterSet>
            <!--Optional:-->
            <!--type: string-->
            <tiet:DataServiceURL>foedere certo</tiet:DataServiceURL>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserLanguageCode>profundum quippe ferant</tiet:UserLanguageCode>
            <!--Optional:-->
            <!--type: string-->
            <tiet:VersionNumber>et carcere</tiet:VersionNumber>
         </tem:MessageHeader>
         <!--Optional:-->
         <tem:Common>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ContractKey>iovis rapidum iaculata</tiet:ContractKey>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserId>speluncis abdidit</tiet:UserId>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingSystem>bella gero et</tiet:CallingSystem>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingUserId>flammas turbine</tiet:CallingUserId>
         </tem:Common>
         <!--Optional:-->
         <tem:ContactQuery>
            <tiet1:PatientId>
               <!--type: string-->
               <tiet1:Identifier>hoc metuens</tiet1:Identifier>
            </tiet1:PatientId>
            <!--type: dateTime-->
            <tiet1:Created_start>2014-06-10T21:33:25+03:00</tiet1:Created_start>
            <!--type: dateTime-->
            <tiet1:Created_end>2003-11-10T09:56:46+02:00</tiet1:Created_end>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:FormsetCode>praeterea aut</tiet1:FormsetCode>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:FormsetCodeSystem>claustra fremunt</tiet1:FormsetCodeSystem>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:FormsetName>imperio premit</tiet1:FormsetName>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:Organisation>quisquam numen</tiet1:Organisation>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:OrgUnit>ac vinclis</tiet1:OrgUnit>
         </tem:ContactQuery>
      </urn:Esitiedot_Kysely_Request>
   </soapenv:Body>
</soapenv:Envelope>